Connected to Dynamips VM "R7" (ID 7, type c7200) - Console port
Press ENTER to get the prompt.
7 255.255.255.255
!
interface FastEthernet0/0
 ip address 10.4.7.2 255.255.255.252
 duplex full
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex full
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex full
!
router ospf 100
 network 7.7.7.7 0.0.0.0 area 0
 network 10.0.0.0 0.0.0.3 area 0
          
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router is
Router(config)#router os 
Router(config)#router ospf 1
Router(config-router)#no net
Router(config-router)#no network 10.0.0.0 0.0.0.3 area 0
Router(config-router)#net
Router(config-router)#network 10.4.7.0 0.0.0.3 are
Router(config-router)#network 10.4.7.0 0.0.0.3 area 0
Router(config-router)#
Router(config-router)#
Router(config-router)#
Router(config-router)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#exit
Router#
Router#
Router#sh run 
*Jul  4 11:22:06.666: %SYS-5-CONFIG_I: Configured from console by console
Router#sh run 
Router#sh run | s r o
router ospf 100
 network 7.7.7.7 0.0.0.0 area 0
 network 10.0.0.0 0.0.0.3 area 0
router ospf 1
 network 10.4.7.0 0.0.0.3 area 0
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#no 
Router(config)#no router os
Router(config)#no router ospf 100
Router(config)#router ospf 1 
Router(config-router)#network 7.7.7.7 0.0.0.0 area 0
Router(config-router)#
Router(config-router)#end
Router#
Router#
Router#
*Jul  4 11:22:33.106: %SYS-5-CONFIG_I: Configured from console by console
Router#
Router#
Router#
Router#
Router#wr
Building configuration...
[OK]
Router#
Router#
*Jul  4 11:23:37.950: %OSPF-5-ADJCHG: Process 1, Nbr 4.4.4.4 on FastEthernet0/0 from LOADING to FULL, Loading Done
Router#
Router#
Router#
Router#
Router#
Router#wr
Building configuration...
[OK]
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname R7
R7(config)#
R7(config)#
R7(config)#end
R7#
R7#wr
Building configuration...

*Jul  4 11:30:08.446: %SYS-5-CONFIG_I: Configured from console by console[OK]
R7#
R7#
R7#
R7#
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.














R7>
R7>enable
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.





R7>
R7>enable
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.














R7>
R7>enable
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.


R7>
R7>enable
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.














R7>
R7>enable
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.













