

IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#terminal length 0
Wed Jul  4 12:28:34.052 UTC
RP/0/0/CPU0:XR1#configure terminal
Wed Jul  4 12:28:34.222 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Wed Jul  4 12:28:34.592 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Wed Jul  4 12:28:34.952 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 11:50:32 2018 by cisco
!
hostname XR1
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#terminal length 0
Wed Jul  4 12:29:06.820 UTC
RP/0/0/CPU0:XR1#configure terminal
Wed Jul  4 12:29:06.980 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Wed Jul  4 12:29:07.400 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Wed Jul  4 12:29:07.700 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 11:50:32 2018 by cisco
!
hostname XR1
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#terminal length 0
Wed Jul  4 12:30:26.595 UTC
RP/0/0/CPU0:XR1#configure terminal
Wed Jul  4 12:30:26.755 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Wed Jul  4 12:30:27.155 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Wed Jul  4 12:30:27.455 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 11:50:32 2018 by cisco
!
hostname XR1
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run 
Wed Jul  4 12:40:45.152 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 11:50:32 2018 by cisco
!
hostname XR1
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 12:42:26.335 UTC
RP/0/0/CPU0:XR1(config)#interface lo0
RP/0/0/CPU0:XR1(config-if)#ipv4 address 20.20.20.20/32
RP/0/0/CPU0:XR1(config-if)#router ospf 1 area 0
RP/0/0/CPU0:XR1(config-ospf-ar)#interface lo0
RP/0/0/CPU0:XR1(config-ospf-ar-if)#commit
Wed Jul  4 12:42:57.173 UTC
RP/0/0/CPU0:XR1(config-ospf-ar-if)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show ospf neighbor 
Wed Jul  4 12:43:31.091 UTC

* Indicates MADJ interface
# Indicates Neighbor awaiting BFD session up

Neighbors for OSPF 1

Neighbor ID     Pri   State           Dead Time   Address         Interface
19.19.19.19     1     FULL/DR         00:00:31    10.19.20.1      GigabitEthernet0/0/0/2
    Neighbor is up for 00:52:56

Total neighbor count: 1
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#terminal length 0
Wed Jul  4 12:43:52.170 UTC
RP/0/0/CPU0:XR1#configure terminal
Wed Jul  4 12:43:52.360 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Wed Jul  4 12:43:52.720 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Wed Jul  4 12:43:53.020 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 12:42:57 2018 by cisco
!
hostname XR1
interface Loopback0
 ipv4 address 20.20.20.20 255.255.255.255
!
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface Loopback0
  !
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: 
Username: cisco
Password: 
 
 
 
 



RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show ospf neighbor 
Wed Jul  4 12:46:46.318 UTC

* Indicates MADJ interface
# Indicates Neighbor awaiting BFD session up

Neighbors for OSPF 1

Neighbor ID     Pri   State           Dead Time   Address         Interface
19.19.19.19     1     FULL/BDR        00:00:37    10.19.20.1      GigabitEthernet0/0/0/2
    Neighbor is up for 00:00:39

Total neighbor count: 1
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 12:46:48.688 UTC
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#clear  ospf process 
Wed Jul  4 12:46:56.617 UTC
Reset ALL OSPF processes? [no]: yes
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#end
                 ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#clear  ospf process 
Wed Jul  4 12:47:01.707 UTC
Reset ALL OSPF processes? [no]: no
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#terminal length 0
Wed Jul  4 12:50:11.384 UTC
RP/0/0/CPU0:XR1#configure terminal
Wed Jul  4 12:50:11.544 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Wed Jul  4 12:50:11.954 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Wed Jul  4 12:50:12.264 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 12:42:57 2018 by cisco
!
hostname XR1
interface Loopback0
 ipv4 address 20.20.20.20 255.255.255.255
!
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface Loopback0
  !
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: 
Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run 
Wed Jul  4 12:58:32.509 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Wed Jul  4 12:42:57 2018 by cisco
!
hostname XR1
interface Loopback0
 ipv4 address 20.20.20.20 255.255.255.255
!
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 shutdown
!
interface GigabitEthernet0/0/0/1
 shutdown
!
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!
router ospf 1
 area 0
  interface Loopback0
  !
  interface GigabitEthernet0/0/0/2
  !
 !
!
end

RP/0/0/CPU0:XR1# 
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 12:58:34.919 UTC
RP/0/0/CPU0:XR1(config)#no router ospf 1
RP/0/0/CPU0:XR1(config)#commit 
Wed Jul  4 12:58:41.049 UTC
RP/0/0/CPU0:XR1(config)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 13:03:15.510 UTC
RP/0/0/CPU0:XR1(config)#router bgp 20
RP/0/0/CPU0:XR1(config-bgp)#commit
Wed Jul  4 13:03:21.919 UTC
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#
*
* The idle timeout is soon to expire on this line
*



































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#router bgp 20
                  ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1#conf t 
Wed Jul  4 13:31:18.055 UTC
RP/0/0/CPU0:XR1(config)#router bgp 20
RP/0/0/CPU0:XR1(config-bgp)#neighbor 10.19.20.1 remote-as 100
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#do sh run interface gigabitEthernet 0/0/0/3
Wed Jul  4 13:32:22.580 UTC
% No such configuration item(s)

RP/0/0/CPU0:XR1(config-bgp)#do sh run interface gigabitEthernet 0/0/0/0
Wed Jul  4 13:32:24.700 UTC
interface GigabitEthernet0/0/0/0
 shutdown
!

RP/0/0/CPU0:XR1(config-bgp)#do sh run interface gigabitEthernet 0/0/0/2
Wed Jul  4 13:32:27.100 UTC
interface GigabitEthernet0/0/0/2
 ipv4 address 10.19.20.2 255.255.255.252
!

RP/0/0/CPU0:XR1(config-bgp)#neighbor 10.19.20.1                        
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast 
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#commit i
                                          ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#commit  
Wed Jul  4 13:32:52.808 UTC

% Failed to commit one or more configuration items during a pseudo-atomic operation. All changes made have been reverted. Please issue 'show configuration failed [inheritance]' from this session to view the errors
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#neighbor 10.19.20.1       
RP/0/0/CPU0:XR1(config-bgp-nbr)#remote-as 100
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast 
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#commit 
Wed Jul  4 13:33:14.337 UTC

% Failed to commit one or more configuration items during a pseudo-atomic operation. All changes made have been reverted. Please issue 'show configuration failed [inheritance]' from this session to view the errors
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#
RP/0/0/CPU0:XR1(config-bgp-nbr-af)#show configuration failed 
Wed Jul  4 13:33:18.316 UTC
!! SEMANTIC ERRORS: This configuration was rejected by 
!! the system due to semantic errors. The individual 
!! errors with each failed configuration command can be 
!! found below.


router bgp 20
 neighbor 10.19.20.1
  address-family ipv4 unicast
!!% 'BGP' detected the 'warning' condition 'The address family has not been initialized'
  !
 !
!
end

RP/0/0/CPU0:XR1(config-bgp-nbr-af)#exit
RP/0/0/CPU0:XR1(config-bgp-nbr)#exit
RP/0/0/CPU0:XR1(config-bgp)#address-family ipv4 unicast
RP/0/0/CPU0:XR1(config-bgp-af)#commit i
                                      ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1(config-bgp-af)#commit  
Wed Jul  4 13:33:37.975 UTC
RP/0/0/CPU0:XR1(config-bgp-af)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show bgp summary 
Wed Jul  4 13:33:45.425 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 0
BGP main routing table version 1
BGP NSR Initial initsync version 0 (Not Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               1          1          0          0           1           0

Some configured eBGP neighbors (under default or non-default vrfs)
do not have both inbound and outbound policies configured for IPv4 Unicast
address family. These neighbors will default to sending and/or
receiving no routes and are marked with '!' in the output below.
Use the 'show bgp neighbor <nbr_address>' command for details.

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100       0       0        0    0    0 00:00:00 Idle!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show bgp summary 
Wed Jul  4 13:33:48.064 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 0
BGP main routing table version 1
BGP NSR Initial initsync version 0 (Not Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               1          1          0          0           1           0

Some configured eBGP neighbors (under default or non-default vrfs)
do not have both inbound and outbound policies configured for IPv4 Unicast
address family. These neighbors will default to sending and/or
receiving no routes and are marked with '!' in the output below.
Use the 'show bgp neighbor <nbr_address>' command for details.

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100       0       0        0    0    0 00:00:00 Idle!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show bgp summary 
Wed Jul  4 13:34:06.463 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 0
BGP main routing table version 1
BGP NSR Initial initsync version 0 (Not Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               1          1          0          0           1           0

Some configured eBGP neighbors (under default or non-default vrfs)
do not have both inbound and outbound policies configured for IPv4 Unicast
address family. These neighbors will default to sending and/or
receiving no routes and are marked with '!' in the output below.
Use the 'show bgp neighbor <nbr_address>' command for details.

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100       2       2        0    0    0 00:00:18          0!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 13:34:29.372 UTC
RP/0/0/CPU0:XR1(config)#route-policy PASS
RP/0/0/CPU0:XR1(config-rpl)#pass 
RP/0/0/CPU0:XR1(config-rpl)#
RP/0/0/CPU0:XR1(config-rpl)#router bgp 20
                             ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1(config-rpl)#exit
RP/0/0/CPU0:XR1(config)#router
router  router-convergence  
RP/0/0/CPU0:XR1(config)#router bgp 20
RP/0/0/CPU0:XR1(config-bgp)#
RP/0/0/CPU0:XR1(config-bgp)#n  
neighbor  neighbor-group  no  nsr
RP/0/0/CPU0:XR1(config-bgp)#neighbor 10.19.20.1
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#p    
password  precedence  pwd  
RP/0/0/CPU0:XR1(config-bgp-nbr)#?
  address-family          Enter Address Family command mode
  advertisement-interval  Minimum interval between sending BGP routing updates
  apply-group             Apply configuration from a group
  apply-group-append      Append apply-group configuration from a group
  apply-group-remove      Remove a group from apply-group configuration
  bestpath                Change default route selection criteria
  bfd                     Configure BFD parameters
  bmp-activate            Enable BMP logging for this neighbor
  capability              Advertise capability to the peer
  clear                   Clear the uncommitted configuration
  cluster-id              Enter cluster id for this neighbor
  commit                  Commit the configuration changes to running
  describe                Describe a command without taking real actions
  description             Neighbor specific description
  dmz-link-bandwidth      Propagate the DMZ link bandwidth
  do                      Run an exec command
  dscp                    Set IP DSCP (DiffServ CodePoint)
  ebgp-multihop           Allow EBGP neighbors not on directly connected networks
  egress-engineering      Enable egress peer engineering for this neighbor
  enforce-first-as        Enforce the first AS for EBGP routes
  exclude-group           Exclude apply-group configuration from a group
  exclude-item            Negate a command or set its defaults
  exit                    Exit from this submode
  graceful-maintenance    Attributes for Graceful Maintenance. This will cause
                          neighbors to de-prefer routes from this router and
                          choose alternates. This allows the router to be
                          brought in or out of service gracefully.
  graceful-restart        Enable graceful restart support for this neighbor
  ignore-connected-check  Bypass the directly connected nexthop check for single-hop eBGP peering
  keychain                Set keychain based authentication
  local                   Configure local parameter
  local-as                Specify local AS number
  log                     Logging update messages per neighbor
  no                      Negate a command or set its defaults
  origin-as               BGP origin-AS knobs
  password                Set a password
  precedence              Set precedence
  pwd                     Commands used to reach current submode
  receive-buffer-size     Set socket and BGP receive buffer size
  remote-as               Set remote AS
  root                    Exit to the global configuration mode
  send-buffer-size        Set socket and BGP send buffer size
  session-open-mode       Establish BGP session using this TCP open mode
  show                    Show contents of configuration
  shutdown                Administratively shut down this neighbor
  tcp                     TCP session configuration commands
  timers                  BGP per neighbor timers
  ttl-security            Enable EBGP TTL security
  update                  BGP Update configuration
  update-source           Source of routing updates
  use                     Inherit configuration from a group
RP/0/0/CPU0:XR1(config-bgp-nbr)# 
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#use >?
                                    ^
% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1(config-bgp-nbr)#use ?
  neighbor-group  Inherit configuration from a neighbor-group
  session-group   Inherit address-family independent config from a session-group
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast ?
  advertise                     Per neighbor advertisement options
  aigp                          Enable AIGP for this neighbor 
  allowas-in                    Allow as-path with my AS present in it
  as-override                   Override matching AS-number while sending update
  bestpath                      Change default route selection criteria
  capability                    Advertise capability to the peer
  default-originate             Originate default route to this neighbor
  long-lived-graceful-restart   Enable long lived graceful restart support
  maximum-prefix                Maximum number of prefixes to accept from this peer
  multipath                     Paths from this neighbor is eligible for multipath
  next-hop-self                 Disable the next hop calculation for this neighbor
  next-hop-unchanged            Do not overwrite next hop before advertising to eBGP peers
  optimal-route-reflection      Configure optiomal-route-reflection for this neighbor
  orf                           Specify ORF and inbound filtering criteria
  origin-as                     BGP origin-AS knobs
  remove-private-AS             Remove private AS number from outbound updates
  route-policy                  Apply route policy to neighbor
  route-reflector-client        Configure a neighbor as Route Reflector client
  send-community-ebgp           Send community attribute to this external neighbor
  send-community-gshut-ebgp     Allow the g-shut community to be sent to this external neighbor
  send-extended-community-ebgp  Send extended community attribute to this external neighbor
  send-multicast-attributes     Send multicast attributes to this neighbor 
  soft-reconfiguration          Per neighbor soft reconfiguration
  use                           Inherit configuration for this address-family from a group
  weight                        Set default weight for routes from this neighbor
  <cr>                          
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast route-
route-policy  route-reflector-client  
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast route-policy ? 
  PASS  Name of the policy
  WORD  Name of the policy
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast route-policy PASS $
RP/0/0/CPU0:XR1(config-bgp-nbr)#address-family ipv4 unicast route-policy PASS $
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#commit 
Wed Jul  4 13:38:07.487 UTC
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#
RP/0/0/CPU0:XR1(config-bgp-nbr)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#show bgp summary 
Wed Jul  4 13:38:19.106 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 0
BGP main routing table version 1
BGP NSR Initial initsync version 1 (Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               1          1          1          1           1           0

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100       6       9        1    0    0 00:04:30          0

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 13:40:46.346 UTC
RP/0/0/CPU0:XR1(config)#router bgp 20
RP/0/0/CPU0:XR1(config-bgp)#      address-family ipv4 unicast
RP/0/0/CPU0:XR1(config-bgp-af)#       network 20.20.20.20/32
RP/0/0/CPU0:XR1(config-bgp-af)#commit 
Wed Jul  4 13:40:53.415 UTC
RP/0/0/CPU0:XR1(config-bgp-af)#
RP/0/0/CPU0:XR1(config-bgp-af)#
RP/0/0/CPU0:XR1(config-bgp-af)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Wed Jul  4 13:40:57.595 UTC
RP/0/0/CPU0:XR1(config)#hostname XR2
RP/0/0/CPU0:XR1(config)#commit 
Wed Jul  4 13:41:03.775 UTC
RP/0/0/CPU0:XR2(config)#
RP/0/0/CPU0:XR2(config)#
RP/0/0/CPU0:XR2(config)#end         
RP/0/0/CPU0:XR2#show bgp summary 
Wed Jul  4 13:41:28.373 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 3
BGP main routing table version 3
BGP NSR Initial initsync version 1 (Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               3          2          2          2           2           0

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100      10      12        2    0    0 00:07:40          1

RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#show bgp summary 
Wed Jul  4 13:41:34.952 UTC
BGP router identifier 20.20.20.20, local AS number 20
BGP generic scan interval 60 secs
Non-stop routing is enabled
BGP table state: Active
Table ID: 0xe0000000   RD version: 3
BGP main routing table version 3
BGP NSR Initial initsync version 1 (Reached)
BGP NSR/ISSU Sync-Group versions 0/0
BGP scan interval 60 secs

BGP is operating in STANDALONE mode.


Process       RcvTblVer   bRIB/RIB   LabelVer  ImportVer  SendTblVer  StandbyVer
Speaker               3          2          2          2           2           0

Neighbor        Spk    AS MsgRcvd MsgSent   TblVer  InQ OutQ  Up/Down  St/PfxRcd
10.19.20.1        0   100      10      12        2    0    0 00:07:46          1

RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#
RP/0/0/CPU0:XR2#ping 1.1.1.1
Wed Jul  4 13:42:12.780 UTC
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
