Connected to Dynamips VM "R8" (ID 8, type c7200) - Console port
Press ENTER to get the prompt.
dress 10.6.8.2 255.255.255.252
R8(config-if)#
R8(config-if)#no shut
R8(config-if)#
R8(config-if)#
*Jul  4 11:35:11.098: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Jul  4 11:35:12.098: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R8(config-if)#
R8(config-if)#
R8(config-if)#
R8(config-if)#
R8(config-if)#no ip add
R8(config-if)#no ip address 
R8(config-if)#ip address 10.6.8.2 255.255.255.252
*Jul  4 11:35:43.482: %DEC21140-5-REMOVE_HWADDR_FAIL: Interface FastEthernet0/0 failed to remove Addr:=0100.5e00.0005 from HWAF

R8(config-if)#ip address 10.5.8.2 255.255.255.252
R8(config-if)#
R8(config-if)#router ospf 1                      
R8(config-router)#
R8(config-router)#no network 10.6.8.0 0.0.0.3 area 0
R8(config-router)#network 10.5.8.0 0.0.0.3 area 0
R8(config-router)#
R8(config-router)#end
R8#
R8#
R8#
*Jul  4 11:36:08.966: %SYS-5-CONFIG_I: Configured from console by console
R8#
R8#
R8#
*Jul  4 11:36:11.098: %OSPF-5-ADJCHG: Process 1, Nbr 5.5.5.5 on FastEthernet0/0 from LOADING to FULL, Loading Done
R8#
R8#sh
R8#show arp
R8#show arp 
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.5.8.1                0   5000.0005.0002  ARPA   FastEthernet0/0
Internet  10.5.8.2                -   ca08.5148.0000  ARPA   FastEthernet0/0
R8#
R8#
R8#wr
Building configuration...
[OK]
R8#
R8#
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.


R8>
R8>enable
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.







R8>
R8>enable
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.











R8>
R8>enable
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.










R8>
R8>enable
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.













R8>
R8>enable
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.


