Connected to Dynamips VM "R1" (ID 1, type c7200) - Console port
Press ENTER to get the prompt.
.255.255.255)

% Bad IP address or host name
Translating "no"...domain server (255.255.255.255)
 (255.255.255.255)
Translating "no"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Router>enable
Router#quit

































Router con0 is now available





Press RETURN to get started.









Router>
Router>no
Translating "no"...domain server (255.255.255.255)

% Bad IP address or host name
Translating "no"...domain server (255.255.255.255)
 (255.255.255.255)
Translating "no"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Router>enable
Router#terminal length 0
Router#quit





























































Router con0 is now available





Press RETURN to get started.


Router>
Router>
Router>
Router>
Router>
Router>
Router>
Router>en
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#exit
Router#
Router#sh
Router#show run 
*Jul  4 09:17:51.531: %SYS-5-CONFIG_I: Configured from console by console
Router#show run 
Building configuration...

Current configuration : 646 bytes
!
! Last configuration change at 09:17:51 UTC Wed Jul 4 2018
!
version 15.2
service timestamps debug datetime msec
service timestamps log datetime msec
!
hostname Router
!
boot-start-marker
boot-end-marker
!
!
!
no aaa new-model
ip cef
!
!
!
!
!
!         
no ipv6 cef
!
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
! 
!
!
!
!
!
!
!
!
!         
!
!
interface FastEthernet0/0
 no ip address
 shutdown
 duplex full
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex full
!
ip forward-protocol nd
!
!
no ip http server
no ip http secure-server
!
!
!
!
control-plane
!         
!
line con 0
 stopbits 1
line aux 0
 stopbits 1
line vty 0 4
 login
!
!
end

Router#      
Router#
Router#
Router#
Router#
Router#
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname R1
R1(config)#commit
             ^
% Invalid input detected at '^' marker.

R1(config)#
R1(config)#
R1(config)#
R1(config)#end
R1#wr
Building configuration...

*Jul  4 09:25:08.831: %SYS-5-CONFIG_I: Configured from console by console[OK]
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#

































R1 con0 is now available





Press RETURN to get started.



R1>
R1>enable
R1#terminal length 0
R1#write
Building configuration...
[OK]
R1#quit





























































R1 con0 is now available





Press RETURN to get started.





R1>
R1>enable
R1#terminal length 0
R1#write
Building configuration...
[OK]
R1#quit





























































R1 con0 is now available





Press RETURN to get started.





R1>
R1>enable
R1#terminal length 0
R1#write
Building configuration...
[OK]
R1#quit





























































R1 con0 is now available





Press RETURN to get started.






R1>
R1>enable
R1#terminal length 0
R1#write
Building configuration...
[OK]
R1#quit





























































R1 con0 is now available





Press RETURN to get started.











R1>en
R1#
R1#
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#inter
R1(config)#interface fa
R1(config)#interface fastEthernet 0
R1(config)#interface fastEthernet 0/0
R1(config-if)#no shut
R1(config-if)#
R1(config-if)#
R1(config-if)#ip add
R1(config-if)#ip address 
*Jul  4 10:58:26.650: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Jul  4 10:58:27.650: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up10.
R1(config-if)#ip address 10.
R1(config-if)#ip address 10.1.2.1 255.255.255.252 
R1(config-if)#
R1(config-if)#
R1(config-if)#
R1(config-if)#end
R1#cofnf
*Jul  4 10:58:39.090: %SYS-5-CONFIG_I: Configured from console by console
R1#cofnf
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#        
R1(config)#
R1(config)#
R1(config)#router os
R1(config)#router ospf 1
R1(config-router)#
R1(config-router)#net
R1(config-router)#network 1.1.1.1 0.0.0.0 are
R1(config-router)#network 1.1.1.1 0.0.0.0 area 0
R1(config-router)#
R1(config-router)#net
R1(config-router)#network 10.1.2.0 0.0.0.3 are
R1(config-router)#network 10.1.2.0 0.0.0.3 area 0
R1(config-router)#
R1(config-router)#end
R1#
R1#
R1#
R1#
R1#
*Jul  4 11:01:48.218: %SYS-5-CONFIG_I: Configured from console by console
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#
R1#sh
R1#show ip os
R1#show ip ospf ne
R1#show ip ospf neighbor 
R1#
R1#
R1#ping 10.
R1#ping 10.1.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/7/12 ms
R1#ping 10.1.2.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 20/39/48 ms
R1#
R1#
R1#
R1#
R1#
R1#
R1#sh
R1#show op os
R1#show ip o 
R1#show ip ospf ne
R1#show ip ospf neighbor 
R1#
R1#
R1#
R1#
R1#sh run } se
R1#sh run | se
R1#sh run | section r o
router ospf 1
 network 1.1.1.1 0.0.0.0 area 0
 network 10.1.2.0 0.0.0.3 area 0
R1#
R1#
R1#
R1#
R1#
R1#show ip ospf neighbor 
R1#
R1#
R1#
R1#sh
R1#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.2.1                -   ca01.4fe3.0000  ARPA   FastEthernet0/0
Internet  10.1.2.2                1   5000.0002.0000  ARPA   FastEthernet0/0
R1#
R1#
R1#
R1#
R1#show ip ospf neighbor 
R1#
R1#
R1#sh run 
Building configuration...

Current configuration : 735 bytes
!
! Last configuration change at 11:01:48 UTC Wed Jul 4 2018
!
version 15.2
service timestamps debug datetime msec
service timestamps log datetime msec
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
!
no aaa new-model
ip cef
!
!
!
!
!
!         
no ipv6 cef
!
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
! 
!
!
!
!
!
!
!
!
!         
!
!
interface FastEthernet0/0
 ip address 10.1.2.1 255.255.255.252
 duplex full
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex full
!
router ospf 1
 network 1.1.1.1 0.0.0.0 area 0
 network 10.1.2.0 0.0.0.3 area 0
!
ip forward-protocol nd
!
!
no ip http server
no ip http secure-server
!
!
          
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#inte
R1(config)#interface lo0
R1(config-if)#ip add
R1(config-if)#ip address 1
*Jul  4 11:07:12.810: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up.1.1.
R1(config-if)#ip address 1.1.1.
R1(config-if)#ip address 1.1.1.1 255.255.255.255
R1(config-if)#end
R1#
R1#
R1#
R1#
*Jul  4 11:07:20.486: %SYS-5-CONFIG_I: Configured from console by console
R1#
R1#
R1#
R1#
R1#
R1#
R1#ping 10.1.2.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/6/8 ms
R1#ping 10.1.2.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.2.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 44/48/52 ms
R1#
R1#
R1#
R1#show ip ospf neighbor 
R1#
R1#
R1#
R1#
R1#
R1#show ip ospf neighbor 
R1#
R1#
R1#
R1#show ip ospf neighbor 
R1#
*Jul  4 11:12:49.674: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on FastEthernet0/0 from LOADING to FULL, Loading Done
R1#
R1#
R1#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/BDR        00:00:36    10.1.2.2        FastEthernet0/0
R1#
R1#
R1#sh run                
Building configuration...

Current configuration : 793 bytes
!
! Last configuration change at 11:07:20 UTC Wed Jul 4 2018
!
version 15.2
service timestamps debug datetime msec
service timestamps log datetime msec
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
!
no aaa new-model
ip cef
!
!
!
!
!
!         
no ipv6 cef
!
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
! 
!
!
!
!
!
!
!
!
!         
!
!
interface Loopback0
 ip address 1.1.1.1 255.255.255.255
!
interface FastEthernet0/0
 ip address 10.1.2.1 255.255.255.252
 duplex full
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex full
!
router ospf 1
 network 1.1.1.1 0.0.0.0 area 0
 network 10.1.2.0 0.0.0.3 area 0
!
ip forward-protocol nd
!
!
no ip http server
          
R1#
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router os
R1(config)#router ospf 1
R1(config-router)#router
R1(config-router)#router-id lo0
                            ^
% Invalid input detected at '^' marker.

R1(config-router)#router-id 1.1.1.1
% OSPF: Reload or use "clear ip ospf process" command, for this to take effect
R1(config-router)#
R1(config-router)#end
R1#
R1#
R1#
R1#clear
R1#clear 
*Jul  4 11:13:55.774: %SYS-5-CONFIG_I: Configured from console by console
R1#clear 
R1#clear ip os
R1#clear ip ospf pr
R1#clear ip ospf process 
Reset ALL OSPF processes? [no]: yes
R1#
R1#
*Jul  4 11:14:01.642: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Interface down or detached
*Jul  4 11:14:01.958: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on FastEthernet0/0 from LOADING to FULL, Loading Done
R1#
R1#
R1#yes
   ^
% Invalid input detected at '^' marker.

R1#clear ip ospf process 
Reset ALL OSPF processes? [no]: no
R1#
R1#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/DR         00:00:36    10.1.2.2        FastEthernet0/0
R1#
R1#
R1#
R1#
R1#
R1#sh
R1#trac         
R1#traceroute 19.19.19.19
Type escape sequence to abort.
Tracing the route to 19.19.19.19
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.2.2 32 msec 48 msec 48 msec
  2 20.2.4.2 [MPLS: Label 406 Exp 0] 48 msec 28 msec 52 msec
  3 20.4.6.2 [MPLS: Label 609 Exp 0] 48 msec 36 msec 48 msec
  4 20.6.19.2 48 msec 36 msec * 
R1#
R1#
R1#
R1#
R1#
R1#
R1#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   FULL/DR         00:00:36    10.1.2.2        FastEthernet0/0
R1#
R1#
R1#
*Jul  4 11:26:13.986: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on FastEthernet0/0 from LOADING to FULL, Loading Done
R1#
R1#
R1#
R1#wr
Building configuration...
[OK]
R1#
R1#
R1#
R1#

































R1 con0 is now available





Press RETURN to get started.











R1>en
R1#wr
Building configuration...
[OK]
R1#
R1#
R1#
R1#
R1#terminal length 0
R1#write
Building configuration...
[OK]
R1#quit





























































R1 con0 is now available





Press RETURN to get started.












