Connected to Dynamips VM "R8" (ID 8, type c7200) - Console port
Press ENTER to get the prompt.
-CHANGED: Interface FastEthernet1/0, changed state to administratively down
*Jul  4 06:55:24.171: %LINK-5-CHANGED: Interface FastEthernet2/0, changed state to administratively down
*Jul  4 06:55:25.151: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to down
*Jul  4 06:55:25.163: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
*Jul  4 06:55:25.175: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet2/0, changed state to down
*Jul  4 06:55:28.043: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 7200 Software (C7200-ADVIPSERVICESK9-M), Version 15.2(4)S5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Thu 20-Feb-14 06:51 by prod_rel_team
*Jul  4 06:55:50.431: %SYS-3-CPUHOG: Task is running for (2024)msecs, more than (2000)msecs (0/0),process = Crypto CA.
-Traceback= 0x61E0E52Cz 0x61E2E6C0z 

































Router con0 is now available





Press RETURN to get started.




Router>
Router>no
Translating "no"...domain server (255.255.255.255)

% Bad IP address or host name
Translating "no"...domain server (255.255.255.255)
 (255.255.255.255)
Translating "no"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Router>enable
Router#quit

































Router con0 is now available





Press RETURN to get started.







Router>
Router>
Router>
Router>
Router>no
Translating "no"...domain server (255.255.255.255)

% Bad IP address or host name
Translating "no"...domain server (255.255.255.255)
 (255.255.255.255)
Translating "no"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Router>enable
Router#terminal length 0
Router#quit





























































Router con0 is now available





Press RETURN to get started.










Router>
Router>
Router>

































Router con0 is now available





Press RETURN to get started.








Router>

































Router con0 is now available





Press RETURN to get started.













Router>
Router>no
Translating "no"...domain server (255.255.255.255)

% Bad IP address or host name
Translating "no"...domain server (255.255.255.255)
 (255.255.255.255)
Translating "no"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Router>enable
Router#terminal length 0
Router#quit





























































Router con0 is now available





Press RETURN to get started.









Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.




Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.


Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.






Router>
Router>
Router>en
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#R8
                ^
% Invalid input detected at '^' marker.

Router(config)#hos
Router(config)#hostname R8
R8(config)#
R8(config)#router os
R8(config)#router ospf 1
R8(config-router)#net
R8(config-router)#network 
*Jul  4 11:34:00.002: %OSPF-4-NORTRID: OSPF process 1 failed to allocate unique router-id and cannot start
R8(config-router)#network 
R8(config-router)#exit    
R8(config)#inte
R8(config)#interface lo0
R8(config-if)#ip add
R8(config-if)#ip address 
*Jul  4 11:34:10.950: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up8.8.8.8 255.255.255.255
R8(config-if)#
R8(config-if)#
R8(config-if)#router is
R8(config-if)#router os
R8(config-if)#router ospf 1
R8(config-router)#net
R8(config-router)#network 8.8.8.8 0.0.0.0 area 0
R8(config-router)#
R8(config-router)#net
R8(config-router)#network 10.6.8.2 255.255.255.252
% Incomplete command.

R8(config-router)#network 10.6.8.0 0.0.0.3 are    
R8(config-router)#network 10.6.8.0 0.0.0.3 area 0
R8(config-router)#
R8(config-router)#
R8(config-router)#exit
R8(config)#inter
R8(config)#interface fa
R8(config)#interface fastEthernet 0/0
R8(config-if)#ip add
R8(config-if)#ip address 10.6.8.2 255.255.255.252
R8(config-if)#
R8(config-if)#no shut
R8(config-if)#
R8(config-if)#
*Jul  4 11:35:11.098: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Jul  4 11:35:12.098: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R8(config-if)#
R8(config-if)#
R8(config-if)#
R8(config-if)#
R8(config-if)#no ip add
R8(config-if)#no ip address 
R8(config-if)#ip address 10.6.8.2 255.255.255.252
*Jul  4 11:35:43.482: %DEC21140-5-REMOVE_HWADDR_FAIL: Interface FastEthernet0/0 failed to remove Addr:=0100.5e00.0005 from HWAF

R8(config-if)#ip address 10.5.8.2 255.255.255.252
R8(config-if)#
R8(config-if)#router ospf 1                      
R8(config-router)#
R8(config-router)#no network 10.6.8.0 0.0.0.3 area 0
R8(config-router)#network 10.5.8.0 0.0.0.3 area 0
R8(config-router)#
R8(config-router)#end
R8#
R8#
R8#
*Jul  4 11:36:08.966: %SYS-5-CONFIG_I: Configured from console by console
R8#
R8#
R8#
*Jul  4 11:36:11.098: %OSPF-5-ADJCHG: Process 1, Nbr 5.5.5.5 on FastEthernet0/0 from LOADING to FULL, Loading Done
R8#
R8#sh
R8#show arp
R8#show arp 
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.5.8.1                0   5000.0005.0002  ARPA   FastEthernet0/0
Internet  10.5.8.2                -   ca08.5148.0000  ARPA   FastEthernet0/0
R8#
R8#
R8#wr
Building configuration...
[OK]
R8#
R8#
R8#terminal length 0
R8#write
Building configuration...
[OK]
R8#quit





























































R8 con0 is now available





Press RETURN to get started.

