Connected to Dynamips VM "R7" (ID 7, type c7200) - Console port
Press ENTER to get the prompt.
:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/7/8 ms
Router#ping 10.0.0. 
% Unrecognized host or address, or protocol not running.

Router#ping 10.0.0.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.0.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 40/47/52 ms
Router#
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router os
Router(config)#router ospf 100
Router(config-router)#net
Router(config-router)#network 10.0.0.0 0.0.0.3 are
Router(config-router)#network 10.0.0.0 0.0.0.3 area 0
Router(config-router)#net
Router(config-router)#network 7
*Jul  4 06:39:57.435: %OSPF-5-ADJCHG: Process 100, Nbr 10.0.0.2 on FastEthernet0/0 from LOADING to FULL, Loading Done.7.7.
Router(config-router)#network 7.7.7.7 0.0.0.0 are
Router(config-router)#network 7.7.7.7 0.0.0.0 area 0
Router(config-router)#inter
Router(config-router)#interface lo10
Router(config-if)#ip add
Router(config-if)#ip address 
*Jul  4 06:40:10.379: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback10, changed state to up7.7.7.7
Router(config-if)#ip address 7.7.7.7 255.255.255.255
Router(config-if)#end
Router#
Router#
Router#
Router#
*Jul  4 06:40:18.567: %SYS-5-CONFIG_I: Configured from console by console
Router#
Router#
Router#
Router#sh
Router#show ip os
Router#show ip ospf ne
Router#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
10.0.0.2          1   FULL/DR         00:00:38    10.0.0.2        FastEthernet0/0
Router#
Router#
Router#sh
Router#show ip route
Router#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/2] via 10.0.0.2, 00:00:28, FastEthernet0/0
      7.0.0.0/32 is subnetted, 1 subnets
C        7.7.7.7 is directly connected, Loopback10
      10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        10.0.0.0/30 is directly connected, FastEthernet0/0
L        10.0.0.1/32 is directly connected, FastEthernet0/0
Router# 
Router#
Router#ping 4.4.4.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 28/53/72 ms
Router#
Router#
Router#
Router#
Router#
Router#

































Router con0 is now available





Press RETURN to get started.



*Jul  4 08:34:19.731: %OSPF-5-ADJCHG: Process 100, Nbr 10.0.0.2 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Dead timer expired
Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.








Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.


Router>

































Router con0 is now available





Press RETURN to get started.







