Connected to Dynamips VM "R7" (ID 7, type c7200) - Console port
Press ENTER to get the prompt.
er(config-if)#ip address 7.7.7.7 255.255.255.255
Router(config-if)#end
Router#
Router#
Router#
Router#
*Jul  4 06:40:18.567: %SYS-5-CONFIG_I: Configured from console by console
Router#
Router#
Router#
Router#sh
Router#show ip os
Router#show ip ospf ne
Router#show ip ospf neighbor 

Neighbor ID     Pri   State           Dead Time   Address         Interface
10.0.0.2          1   FULL/DR         00:00:38    10.0.0.2        FastEthernet0/0
Router#
Router#
Router#sh
Router#show ip route
Router#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/2] via 10.0.0.2, 00:00:28, FastEthernet0/0
      7.0.0.0/32 is subnetted, 1 subnets
C        7.7.7.7 is directly connected, Loopback10
      10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        10.0.0.0/30 is directly connected, FastEthernet0/0
L        10.0.0.1/32 is directly connected, FastEthernet0/0
Router# 
Router#
Router#ping 4.4.4.4
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 4.4.4.4, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 28/53/72 ms
Router#
Router#
Router#
Router#
Router#
Router#

































Router con0 is now available





Press RETURN to get started.



*Jul  4 08:34:19.731: %OSPF-5-ADJCHG: Process 100, Nbr 10.0.0.2 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Dead timer expired
Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.








Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.


Router>

































Router con0 is now available





Press RETURN to get started.








Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.


Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.




Router>
Router>enable
Router#terminal length 0
Router#write
Building configuration...
[OK]
Router#quit





























































Router con0 is now available





Press RETURN to get started.











Router>
Router>terminal length 0
Router>quit





























































Router con0 is now available





Press RETURN to get started.





Router>
Router>en
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#
Router(config)#inter
Router(config)#interface f
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip add
Router(config-if)#ip address 10.4.7.2 255.255.255.252
Router(config-if)#no shut
Router(config-if)#     
Router(config-if)#
Router(config-if)#
Router(config-if)#inter
Router(config-if)#inter lo0
Router(config-if)#ip add
Router(config-if)#ip address 
*Jul  4 11:20:02.506: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up7.7.7.7 255.255.255.255
% 7.7.7.7 overlaps with Loopback10
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#no int lo10
Router(config)#inter lo0                         
Router(config-if)#ip address 7.7.7.7 255.255.255.255
*Jul  4 11:20:17.682: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback10, changed state to down
*Jul  4 11:20:17.686: %LINK-5-CHANGED: Interface Loopback10, changed state to administratively down
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#
Router(config-if)#exit
Router(config)#
Router(config)#
Router(config)#exit
Router#
Router#sh run 
Building configuration...

*Jul  4 11:20:28.334: %SYS-5-CONFIG_I: Configured from console by console
Current configuration : 865 bytes
!
! Last configuration change at 11:20:28 UTC Wed Jul 4 2018
!
version 15.2
service timestamps debug datetime msec
service timestamps log datetime msec
!
hostname Router
!
boot-start-marker
boot-end-marker
!
!
!
no aaa new-model
ip cef
!
!
!
!
!
!         
no ipv6 cef
!
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
! 
!
!
!
!
!
!
!
!
!         
!
!
interface Loopback0
 ip address 7.7.7.7 255.255.255.255
!
interface FastEthernet0/0
 ip address 10.4.7.2 255.255.255.252
 duplex full
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex full
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex full
!
router ospf 100
 network 7.7.7.7 0.0.0.0 area 0
 network 10.0.0.0 0.0.0.3 area 0
          
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router is
Router(config)#router os 
Router(config)#router ospf 1
Router(config-router)#no net
Router(config-router)#no network 10.0.0.0 0.0.0.3 area 0
Router(config-router)#net
Router(config-router)#network 10.4.7.0 0.0.0.3 are
Router(config-router)#network 10.4.7.0 0.0.0.3 area 0
Router(config-router)#
Router(config-router)#
Router(config-router)#
Router(config-router)#exit
Router(config)#
Router(config)#
Router(config)#
Router(config)#exit
Router#
Router#
Router#sh run 
*Jul  4 11:22:06.666: %SYS-5-CONFIG_I: Configured from console by console
Router#sh run 
Router#sh run | s r o
router ospf 100
 network 7.7.7.7 0.0.0.0 area 0
 network 10.0.0.0 0.0.0.3 area 0
router ospf 1
 network 10.4.7.0 0.0.0.3 area 0
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#no 
Router(config)#no router os
Router(config)#no router ospf 100
Router(config)#router ospf 1 
Router(config-router)#network 7.7.7.7 0.0.0.0 area 0
Router(config-router)#
Router(config-router)#end
Router#
Router#
Router#
*Jul  4 11:22:33.106: %SYS-5-CONFIG_I: Configured from console by console
Router#
Router#
Router#
Router#
Router#wr
Building configuration...
[OK]
Router#
Router#
*Jul  4 11:23:37.950: %OSPF-5-ADJCHG: Process 1, Nbr 4.4.4.4 on FastEthernet0/0 from LOADING to FULL, Loading Done
Router#
Router#
Router#
Router#
Router#
Router#wr
Building configuration...
[OK]
Router#
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname R7
R7(config)#
R7(config)#
R7(config)#end
R7#
R7#wr
Building configuration...

*Jul  4 11:30:08.446: %SYS-5-CONFIG_I: Configured from console by console[OK]
R7#
R7#
R7#
R7#
R7#terminal length 0
R7#write
Building configuration...
[OK]
R7#quit





























































R7 con0 is now available





Press RETURN to get started.













