
CSR2(config-router-af)#
CSR2(config-router-af)#end
CSR2#
CSR2#
CSR2#sh
CSR2#show 
*Jul 10 12:39:20.333: %SYS-5-CONFIG_I: Configured from console by consoleip route
CSR2#show ip route 
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override, p - overrides from PfR

Gateway of last resort is not set

      2.0.0.0/32 is subnetted, 1 subnets
C        2.2.2.2 is directly connected, Loopback0
      3.0.0.0/32 is subnetted, 1 subnets
O        3.3.3.3 [110/2] via 20.2.3.2, 00:14:10, GigabitEthernet3
      4.0.0.0/32 is subnetted, 1 subnets
O        4.4.4.4 [110/2] via 20.2.4.2, 00:14:10, GigabitEthernet2
      5.0.0.0/32 is subnetted, 1 subnets
O        5.5.5.5 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
      6.0.0.0/32 is subnetted, 1 subnets
O        6.6.6.6 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
                 [110/3] via 20.2.3.2, 00:14:10, GigabitEthernet3
      7.0.0.0/32 is subnetted, 1 subnets
O        7.7.7.7 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
      8.0.0.0/32 is subnetted, 1 subnets
O        8.8.8.8 [110/4] via 20.2.4.2, 00:14:10, GigabitEthernet2
      10.0.0.0/30 is subnetted, 2 subnets
O        10.4.7.0 [110/2] via 20.2.4.2, 00:14:10, GigabitEthernet2
O        10.5.8.0 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
      19.0.0.0/32 is subnetted, 1 subnets
O        19.19.19.19 [110/4] via 20.2.4.2, 00:14:10, GigabitEthernet2
                     [110/4] via 20.2.3.2, 00:14:10, GigabitEthernet3
      20.0.0.0/8 is variably subnetted, 11 subnets, 2 masks
C        20.2.3.0/30 is directly connected, GigabitEthernet3
L        20.2.3.1/32 is directly connected, GigabitEthernet3
C        20.2.4.0/30 is directly connected, GigabitEthernet2
L        20.2.4.1/32 is directly connected, GigabitEthernet2
O        20.3.4.0/30 [110/2] via 20.2.4.2, 00:14:10, GigabitEthernet2
                     [110/2] via 20.2.3.2, 00:14:10, GigabitEthernet3
O        20.3.6.0/30 [110/2] via 20.2.3.2, 00:14:10, GigabitEthernet3
O        20.4.5.0/30 [110/2] via 20.2.4.2, 00:14:10, GigabitEthernet2
O        20.4.6.0/30 [110/2] via 20.2.4.2, 00:14:10, GigabitEthernet2
O        20.5.6.0/30 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
                     [110/3] via 20.2.3.2, 00:14:10, GigabitEthernet3
O        20.5.19.0/30 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
O        20.6.19.0/30 [110/3] via 20.2.4.2, 00:14:10, GigabitEthernet2
                      [110/3] via 20.2.3.2, 00:14:10, GigabitEthernet3
CSR2#  
CSR2#
CSR2#sh run | s r b
router bgp 100
 bgp log-neighbor-changes
 no bgp default ipv4-unicast
 neighbor 19.19.19.19 remote-as 100
 neighbor 19.19.19.19 update-source Loopback0
 !
 address-family ipv4
  neighbor 19.19.19.19 activate
  neighbor 19.19.19.19 next-hop-self
 exit-address-family
 !
 address-family vpnv4
  neighbor 19.19.19.19 activate
  neighbor 19.19.19.19 send-community extended
 exit-address-family
 !
 address-family ipv4 vrf VPN_A
  redistribute ospf 100
 exit-address-family
CSR2#
CSR2#sh run | s r o
router ospf 100 vrf VPN_A
 redistribute bgp 100 subnets
 network 10.1.2.0 0.0.0.3 area 0
router ospf 1
 network 2.2.2.2 0.0.0.0 area 0
 network 20.2.3.0 0.0.0.3 area 0
 network 20.2.4.0 0.0.0.3 area 0
 mpls ldp sync
CSR2#
