Connected to Dynamips VM "R1" (ID 1, type c7200) - Console port
Press ENTER to get the prompt.
 32 msec 48 msec
  4 20.6.19.2 [MPLS: Label 19006 Exp 0] 48 msec 40 msec 52 msec
  5 10.19.20.2 48 msec 44 msec * 
R1#
R1#
R1#show ip route                    
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback0
      10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C        10.1.2.0/30 is directly connected, FastEthernet0/0
L        10.1.2.1/32 is directly connected, FastEthernet0/0
O E2     10.19.20.0/30 [110/1] via 10.1.2.2, 00:02:25, FastEthernet0/0
      20.0.0.0/32 is subnetted, 1 subnets
O E2     20.20.20.20 [110/2] via 10.1.2.2, 00:02:25, FastEthernet0/0
R1#
R1#
R1#

































R1 con0 is now available





Press RETURN to get started.














R1>
R1>en
R1#
R1#sh
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback0
      10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C        10.1.2.0/30 is directly connected, FastEthernet0/0
L        10.1.2.1/32 is directly connected, FastEthernet0/0
O E2     10.19.20.0/30 [110/1] via 10.1.2.2, 00:16:26, FastEthernet0/0
      20.0.0.0/32 is subnetted, 1 subnets
O E2     20.20.20.20 [110/2] via 10.1.2.2, 00:16:26, FastEthernet0/0
R1#
R1#
R1#show bgp vpnv4 unicast all 1.1.1.1/32
% BGP not active

R1#
R1#
R1#show ip route                        
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback0
      10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C        10.1.2.0/30 is directly connected, FastEthernet0/0
L        10.1.2.1/32 is directly connected, FastEthernet0/0
O IA     10.19.20.0/30 [110/2] via 10.1.2.2, 00:00:05, FastEthernet0/0
      20.0.0.0/32 is subnetted, 1 subnets
O IA     20.20.20.20 [110/3] via 10.1.2.2, 00:00:05, FastEthernet0/0
R1#
R1#
R1#

































R1 con0 is now available





Press RETURN to get started.











R1>en
R1#
R1#
R1#sh run | s r b
R1#
R1#sh run | s r o
router ospf 100
 network 1.1.1.1 0.0.0.0 area 0
 network 10.1.2.0 0.0.0.3 area 0
R1#
R1#
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#no router os
R1(config)#no router ospf 100
R1(config)#
R1(config)#
R1(config)#ro
*Jul 10 13:37:16.461: %OSPF-5-ADJCHG: Process 100, Nbr 10.1.2.2 on FastEthernet0/0 from FULL to DOWN, Neighbor Down: Interface down or detachedut
R1(config)#route
R1(config)#route
R1(config)#router bg
R1(config)#router bgp 1  
R1(config-router)#
R1(config-router)#add
R1(config-router)#address-family ip
R1(config-router)#address-family ipv4
R1(config-router)#address-family ipv4 un
R1(config-router)#address-family ipv4 unicast ?
  vrf  Specify parameters for a VPN Routing/Forwarding instance
  <cr>

R1(config-router)#address-family ipv4 unicast 
R1(config-router-af)#
R1(config-router-af)#nei
R1(config-router-af)#neighbor 10.1.2.2 remo
R1(config-router-af)#neighbor 10.1.2.2 ?                 
  activate                Enable the Address Family for this Neighbor
  additional-paths        Negotiate additional paths capabilities with this
                          neighbor
  advertise               Advertise to this neighbor
  advertise-map           specify route-map for conditional advertisement
  advertisement-interval  Minimum interval between sending BGP routing updates
  allowas-in              Accept as-path with my AS present in it
  announce                Announce RPKI State using an Extended Community
  capability              Advertise capability to the peer
  default-originate       Originate default route to this neighbor
  distribute-list         Filter updates to/from this neighbor
  dmzlink-bw              Propagate the DMZ link bandwidth
  filter-list             Establish BGP filters
  inherit                 Inherit a template
  maximum-prefix          Maximum number of prefixes accepted from this peer
  next-hop-self           Disable the next hop calculation for this neighbor
  next-hop-unchanged      Propagate next hop unchanged for iBGP paths to this
                          neighbor
  prefix-list             Filter updates to/from this neighbor
  remove-private-as       Remove private AS number from outbound updates
  route-map               Apply route map to neighbor
  route-reflector-client  Configure a neighbor as Route Reflector client
  route-server-client     Configure a neighbor as Route Server client
  send-community          Send Community attribute to this neighbor
  send-label              Send NLRI + MPLS Label to this peer
  slow-peer               Configure slow-peer
  soft-reconfiguration    Per neighbor soft reconfiguration
  soo                     Site-of-Origin extended community
  translate-update        Translate Update to MBGP format
  unsuppress-map          Route-map to selectively unsuppress suppressed routes
  weight                  Set default weight for routes from this neighbor

R1(config-router-af)#exit              
R1(config-router)#neu
R1(config-router)#nei
R1(config-router)#neighbor 10.1.2.2 remo
R1(config-router)#neighbor 10.1.2.2 remote-as 100
R1(config-router)#
R1(config-router)#add
R1(config-router)#address-family ip
R1(config-router)#address-family ipv4
R1(config-router)#address-family ipv4 un
R1(config-router)#address-family ipv4 unicast 
R1(config-router-af)#nei
R1(config-router-af)#neighbor 10.1.2.2 acti
R1(config-router-af)#neighbor 10.1.2.2 activate 
R1(config-router-af)#net
R1(config-router-af)#network 1.1.1.1 ma
R1(config-router-af)#network 1.1.1.1 mask 255.255.255.255
R1(config-router-af)#en
                      ^
% Invalid input detected at '^' marker.

R1(config-router-af)#
R1(config-router-af)#end
R1#
R1#
R1#
*Jul 10 13:38:43.053: %SYS-5-CONFIG_I: Configured from console by console
*Jul 10 13:39:59.977: %BGP-5-ADJCHANGE: neighbor 10.1.2.2 Up 
R1#
R1#sh            
R1#show bg
R1#show bgp sum
R1#show bgp sum
BGP router identifier 1.1.1.1, local AS number 1
BGP table version is 4, main routing table version 4
3 network entries using 432 bytes of memory
3 path entries using 240 bytes of memory
2/2 BGP path/bestpath attribute entries using 272 bytes of memory
1 BGP AS-PATH entries using 24 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
BGP using 968 total bytes of memory
BGP activity 3/0 prefixes, 3/0 paths, scan interval 60 secs

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.1.2.2        4          100       6       5        4    0    0 00:00:34        2
R1#
R1#sh
R1#show bgp    
BGP table version is 4, local router ID is 1.1.1.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>  1.1.1.1/32       0.0.0.0                  0         32768 i
 *>  10.19.20.0/30    10.1.2.2                               0 100 ?
 *>  20.20.20.20/32   10.1.2.2                               0 100 ?
R1#
R1#
R1#
R1#
R1#sh
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       + - replicated route, % - next hop override

Gateway of last resort is not set

      1.0.0.0/32 is subnetted, 1 subnets
C        1.1.1.1 is directly connected, Loopback0
      10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C        10.1.2.0/30 is directly connected, FastEthernet0/0
L        10.1.2.1/32 is directly connected, FastEthernet0/0
B        10.19.20.0/30 [20/0] via 10.1.2.2, 00:00:59
      20.0.0.0/32 is subnetted, 1 subnets
B        20.20.20.20 [20/0] via 10.1.2.2, 00:00:59
R1#
R1#
R1#
R1#ping 20.20.20.20 so
R1#ping 20.20.20.20 source lo0
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 20.20.20.20, timeout is 2 seconds:
Packet sent with a source address of 1.1.1.1 
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 44/52/56 ms
R1#
R1#
R1#tracero
R1#traceroute 20.20.20.20 so lo0
Type escape sequence to abort.
Tracing the route to 20.20.20.20
VRF info: (vrf in name/id, vrf out name/id)
  1 10.1.2.2 44 msec 40 msec 48 msec
  2 20.2.3.2 [MPLS: Labels 303/19006 Exp 0] 48 msec 68 msec 48 msec
  3 20.3.6.2 [MPLS: Labels 603/19006 Exp 0] 52 msec 52 msec 72 msec
  4 20.6.19.2 [MPLS: Label 19006 Exp 0] 76 msec 32 msec 48 msec
  5 10.19.20.2 [AS 100] 52 msec 32 msec * 
