
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#?        
  apply-group         Apply configuration from a group
  apply-group-append  Append apply-group configuration from a group
  apply-group-remove  Remove a group from apply-group configuration
  authentication      Authentication configuration
  bandwidth-percent   Bandwidth limit
  bfd                 Configure BFD parameters
  clear               Clear the uncommitted configuration
  commit              Commit the configuration changes to running
  describe            Describe a command without taking real actions
  do                  Run an exec command
  exclude-group       Exclude apply-group configuration from a group
  exclude-item        Negate a command or set its defaults
  exit                Exit from this submode
  hello-interval      Hello interval
  hold-time           Hold Time
  metric              Metric
  neighbor            Configure Neighbor
  next-hop-self       Configure next-hop-self
  no                  Negate a command or set its defaults
  passive-interface   Suppress routing updates on an interface
  pwd                 Commands used to reach current submode
  remote-neighbor     Configure Remote-Neighbor
  root                Exit to the global configuration mode
  route-policy        Configure inbound/outbound interface policies
  show                Show contents of configuration
  site-of-origin      Configure Site-of-origin
  split-horizon       Configure split horizon behaviour
  summary-address     Summary address
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af-if)#exit
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run router eigrp
Tue Jul 10 10:56:39.335 UTC
router eigrp 1
 vrf VPN_A
  address-family ipv4
   interface GigabitEthernet0/0/0/2
   !
  !
 !
!

RP/0/0/CPU0:XR1#conf exclusive 
Tue Jul 10 10:57:09.113 UTC

Successfully entered exclusive mode with no retry needed.
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#router eigrp 1
RP/0/0/CPU0:XR1(config-eigrp)#
RP/0/0/CPU0:XR1(config-eigrp)#vrf VPN_A
RP/0/0/CPU0:XR1(config-eigrp-vrf)#?     
  address-family      EIGRP VRF address-family configuration submode
  apply-group         Apply configuration from a group
  apply-group-append  Append apply-group configuration from a group
  apply-group-remove  Remove a group from apply-group configuration
  clear               Clear the uncommitted configuration
  commit              Commit the configuration changes to running
  describe            Describe a command without taking real actions
  do                  Run an exec command
  exclude-group       Exclude apply-group configuration from a group
  exclude-item        Negate a command or set its defaults
  exit                Exit from this submode
  no                  Negate a command or set its defaults
  pwd                 Commands used to reach current submode
  root                Exit to the global configuration mode
  show                Show contents of configuration
RP/0/0/CPU0:XR1(config-eigrp-vrf)#address-family ipv4 ?
  auto-summary           Auto summarisation
  autonomous-system      Set the autonomous system of VRF
  default-information    Handling of default route
  default-metric         Set metric of redistributed routes
  distance               Set distance for EIGRP routes
  interface              EIGRP interface configuration submode
  log-neighbor-changes   Enable/Disable EIGRP neighbor logging
  log-neighbor-warnings  Enable/Disable EIGRP neighbor warnings
  maximum-paths          Maximum paths
  maximum-prefix         Maximum number of IP prefixes acceptable in aggregate
  metric                 Modify EIGRP routing metrics and parameters
  neighbor               Neighbor prefix limits configuration
  nsf                    Address family specific NSF related configuration
  passive-interface      Suppress routing updates on all interfaces
  redistribute           Redistribute another protocol
  route-policy           Configure inbound/outbound policies
  router-id              Set router ID
  stub                   EIGRP stub
  timers                 Configure EIGRP timers
  variance               Control load balancing variance
  <cr>                   
RP/0/0/CPU0:XR1(config-eigrp-vrf)#address-family ipv4 
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#autonomous-system 1
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#?
  apply-group            Apply configuration from a group
  apply-group-append     Append apply-group configuration from a group
  apply-group-remove     Remove a group from apply-group configuration
  auto-summary           Auto summarisation
  autonomous-system      Set the autonomous system of VRF
  clear                  Clear the uncommitted configuration
  commit                 Commit the configuration changes to running
  default-information    Handling of default route
  default-metric         Set metric of redistributed routes
  describe               Describe a command without taking real actions
  distance               Set distance for EIGRP routes
  do                     Run an exec command
  exclude-group          Exclude apply-group configuration from a group
  exclude-item           Negate a command or set its defaults
  exit                   Exit from this submode
  interface              EIGRP interface configuration submode
  log-neighbor-changes   Enable/Disable EIGRP neighbor logging
  log-neighbor-warnings  Enable/Disable EIGRP neighbor warnings
  maximum-paths          Maximum paths
  maximum-prefix         Maximum number of IP prefixes acceptable in aggregate
  metric                 Modify EIGRP routing metrics and parameters
  neighbor               Neighbor prefix limits configuration
  no                     Negate a command or set its defaults
  nsf                    Address family specific NSF related configuration
  passive-interface      Suppress routing updates on all interfaces
  pwd                    Commands used to reach current submode
  redistribute           Redistribute another protocol
  root                   Exit to the global configuration mode
  route-policy           Configure inbound/outbound policies
  router-id              Set router ID
  show                   Show contents of configuration
  stub                   EIGRP stub
  timers                 Configure EIGRP timers
  variance               Control load balancing variance
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#redistribute bgp 100
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#commit 
Tue Jul 10 11:01:46.314 UTC
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#
RP/0/0/CPU0:XR1(config-eigrp-vrf-af)#end
RP/0/0/CPU0:XR1#sh run router eigrp
Tue Jul 10 11:01:50.493 UTC
router eigrp 1
 vrf VPN_A
  address-family ipv4
   autonomous-system 1
   redistribute bgp 100
   interface GigabitEthernet0/0/0/2
   !
  !
 !
!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
*
* The idle timeout is soon to expire on this line
*



































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: cisco
Password: 


RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run router eigrp 
Tue Jul 10 11:20:41.046 UTC
router eigrp 1
 vrf VPN_A
  address-family ipv4
   autonomous-system 1
   redistribute bgp 100
   interface GigabitEthernet0/0/0/2
   !
  !
 !
!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run router bgp   
Tue Jul 10 11:20:44.936 UTC
router bgp 100
 address-family ipv4 unicast
 !
 address-family vpnv4 unicast
 !
 neighbor 2.2.2.2
  remote-as 100
  update-source Loopback0
  address-family ipv4 unicast
   next-hop-self
  !
  address-family vpnv4 unicast
  !
 !
 vrf VPN_A
  rd 100:1
  address-family ipv4 unicast
   redistribute rip
  !
 !
!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf exclusive 
Tue Jul 10 11:20:55.085 UTC

Successfully entered exclusive mode with no retry needed.
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#route
route-policy  router  router-convergence  
RP/0/0/CPU0:XR1(config)#router
router  router-convergence  
RP/0/0/CPU0:XR1(config)#router bgp 100
RP/0/0/CPU0:XR1(config-bgp)#vrf v 
RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#exit
RP/0/0/CPU0:XR1(config-bgp)#end
Uncommitted changes found, commit them before exiting(yes/no/cancel)? [cancel]:no
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf exclusive 
Tue Jul 10 11:21:24.853 UTC

Successfully entered exclusive mode with no retry needed.
RP/0/0/CPU0:XR1(config)#router bgp 100
RP/0/0/CPU0:XR1(config-bgp)#vrf VPN_A
RP/0/0/CPU0:XR1(config-bgp-vrf)#address-family ipv4 unicast 
RP/0/0/CPU0:XR1(config-bgp-vrf-af)#no redistribute rip
RP/0/0/CPU0:XR1(config-bgp-vrf-af)#redistribute eigrp 1
RP/0/0/CPU0:XR1(config-bgp-vrf-af)#commit 
Tue Jul 10 11:21:56.771 UTC
RP/0/0/CPU0:XR1(config-bgp-vrf-af)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
*
* The idle timeout is soon to expire on this line
*



































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.



IMPORTANT:  READ CAREFULLY
Welcome to the Demo Version of Cisco IOS XRv (the "Software").
The Software is subject to and governed by the terms and conditions
of the End User License Agreement and the Supplemental End User
License Agreement accompanying the product, made available at the
time of your order, or posted on the Cisco website at
www.cisco.com/go/terms (collectively, the "Agreement").
As set forth more fully in the Agreement, use of the Software is
strictly limited to internal use in a non-production environment
solely for demonstration and evaluation purposes.  Downloading,
installing, or using the Software constitutes acceptance of the
Agreement, and you are binding yourself and the business entity
that you represent to the Agreement.  If you do not agree to all
of the terms of the Agreement, then Cisco is unwilling to license
the Software to you and (a) you may not download, install or use the
Software, and (b) you may return the Software as more fully set forth
in the Agreement.


Please login with any configured user/password, or cisco/cisco


User Access Verification

Username: 
Username: 


User Access Verification

Username: 
Username: cisco
Password: 


RP/0/0/CPU0:XR1#terminal length 0
Tue Jul 10 11:45:53.042 UTC
RP/0/0/CPU0:XR1#configure terminal
Tue Jul 10 11:45:53.202 UTC
RP/0/0/CPU0:XR1(config)#no logging console
RP/0/0/CPU0:XR1(config)#commit
Tue Jul 10 11:45:53.642 UTC
RP/0/0/CPU0:XR1(config)#exit
RP/0/0/CPU0:XR1#show running-config
Tue Jul 10 11:45:53.992 UTC
Building configuration...
!! IOS XR Configuration 6.0.1
!! Last configuration change at Tue Jul 10 11:21:56 2018 by cisco
!
hostname XR1
vrf VPN_A
 address-family ipv4 unicast
  import route-target
   100:1
  !
  export route-target
   100:1
  !
 !
!
ipv4 access-list LABELS
 10 permit ipv4 host 2.2.2.2 any
 20 permit ipv4 host 3.3.3.3 any
 30 permit ipv4 host 4.4.4.4 any
 40 permit ipv4 host 5.5.5.5 any
 50 permit ipv4 host 6.6.6.6 any
 60 permit ipv4 host 19.19.19.19 any
!
interface Loopback0
 ipv4 address 19.19.19.19 255.255.255.255
!
interface MgmtEth0/0/CPU0/0
 shutdown
!
interface GigabitEthernet0/0/0/0
 ipv4 address 20.6.19.2 255.255.255.252
!
interface GigabitEthernet0/0/0/1
 ipv4 address 20.5.19.2 255.255.255.252
!
interface GigabitEthernet0/0/0/2
 vrf VPN_A
 ipv4 address 10.19.20.1 255.255.255.252
!
route-policy PASS
  pass
end-policy
!
route-policy BGP_TO_RIP
  if destination in (10.1.2.0/24) then
    set rip-metric 1
  else
    pass
  endif
end-policy
!
router ospf 1
 mpls ldp sync
 area 0
  interface Loopback0
  !
  interface GigabitEthernet0/0/0/0
  !
  interface GigabitEthernet0/0/0/1
  !
  interface GigabitEthernet0/0/0/2
  !
 !
!
router bgp 100
 address-family ipv4 unicast
 !
 address-family vpnv4 unicast
 !
 neighbor 2.2.2.2
  remote-as 100
  update-source Loopback0
  address-family ipv4 unicast
   next-hop-self
  !
  address-family vpnv4 unicast
  !
 !
 vrf VPN_A
  rd 100:1
  address-family ipv4 unicast
   redistribute eigrp 1
  !
 !
!
mpls ldp
 session protection
 address-family ipv4
  label
   local
    allocate for LABELS
   !
  !
 !
 interface GigabitEthernet0/0/0/0
 !
 interface GigabitEthernet0/0/0/1
 !
!
mpls label range table 0 19000 19099
router eigrp 1
 vrf VPN_A
  address-family ipv4
   autonomous-system 1
   redistribute bgp 100
   interface GigabitEthernet0/0/0/2
   !
  !
 !
!
end

RP/0/0/CPU0:XR1#quit


































































































































XR1 con0/0/CPU0 is now available





Press RETURN to get started.

