
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run router bgp
Tue Jul 10 16:26:06.070 UTC
router bgp 100
 address-family ipv4 unicast
 !
 address-family vpnv4 unicast
 !
 neighbor 2.2.2.2
  remote-as 100
  update-source Loopback0
  address-family ipv4 unicast
   next-hop-self
  !
  address-family vpnv4 unicast
  !
 !
 vrf VPN_A
  rd 100:1
  address-family ipv4 unicast
   redistribute ospf 100
  !
  neighbor 10.19.20.2
   remote-as 1
   address-family ipv4 unicast
   !
  !
 !
!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run formal | i pass
Tue Jul 10 16:27:37.904 UTC
Building configuration...
  pass
    pass
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#conf t
Tue Jul 10 16:29:15.387 UTC
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#router bgp 100
RP/0/0/CPU0:XR1(config-bgp)#vrf VPN_A
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 ?
  address-family          Enter Address Family command mode
  advertisement-interval  Minimum interval between sending BGP routing updates
  bfd                     Configure BFD parameters
  bmp-activate            Enable BMP logging for this neighbor
  capability              Advertise capability to the peer
  description             Neighbor specific description
  dmz-link-bandwidth      Propagate the DMZ link bandwidth
  dscp                    Set IP DSCP (DiffServ CodePoint)
  ebgp-multihop           Allow EBGP neighbors not on directly connected networks
  egress-engineering      Enable egress peer engineering for this neighbor
  enforce-first-as        Enforce the first AS for EBGP routes
  graceful-maintenance    Attributes for Graceful Maintenance. This will cause
                          neighbors to de-prefer routes from this router and
                          choose alternates. This allows the router to be
                          brought in or out of service gracefully.
  graceful-restart        Enable graceful restart support for this neighbor
  ignore-connected-check  Bypass the directly connected nexthop check for single-hop eBGP peering
  internal-vpn-client     Preserve iBGP CE neighbor path in ATTR_SET across VPN core
  keychain                Set keychain based authentication
  local                   Configure local parameter
  local-as                Specify local AS number
  log                     Logging update messages per neighbor
  password                Set a password
  precedence              Set precedence
  receive-buffer-size     Set socket and BGP receive buffer size
  remote-as               Set remote AS
  send-buffer-size        Set socket and BGP send buffer size
  session-open-mode       Establish BGP session using this TCP open mode
  shutdown                Administratively shut down this neighbor
  tcp                     TCP session configuration commands
  timers                  BGP per neighbor timers
  ttl-security            Enable EBGP TTL security
  update                  BGP Update configuration
  update-source           Source of routing updates
  use                     Inherit configuration from a group
  <cr>                    
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 use ?
  neighbor-group  Inherit configuration from a neighbor-group
  session-group   Inherit address-family independent config from a session-group
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 address-family ?
  ipv4  IPv4 Address Family
  ipv6  IPv6 Address Family
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 address-family ipv4 ?
  flowspec         Address Family modifier
  labeled-unicast  Address Family modifier
  multicast        Address Family modifier
  unicast          Address Family modifier
RP/0/0/CPU0:XR1(config-bgp-vrf)#$family ipv4 unicast ?dress-family ipv4 un
  advertise                     Per neighbor advertisement options
  aigp                          Enable AIGP for this neighbor 
  allowas-in                    Allow as-path with my AS present in it
  as-override                   Override matching AS-number while sending update
  capability                    Advertise capability to the peer
  default-originate             Originate default route to this neighbor
  long-lived-graceful-restart   Enable long lived graceful restart support
  maximum-prefix                Maximum number of prefixes to accept from this peer
  multipath                     Paths from this neighbor is eligible for multipath
  next-hop-self                 Disable the next hop calculation for this neighbor
  next-hop-unchanged            Do not overwrite next hop before advertising to eBGP peers
  optimal-route-reflection      Configure optiomal-route-reflection for this neighbor
  orf                           Specify ORF and inbound filtering criteria
  remove-private-AS             Remove private AS number from outbound updates
  route-policy                  Apply route policy to neighbor
  route-reflector-client        Configure a neighbor as Route Reflector client
  send-community-ebgp           Send community attribute to this external neighbor
  send-community-gshut-ebgp     Allow the g-shut community to be sent to this external neighbor
  send-extended-community-ebgp  Send extended community attribute to this external neighbor
  site-of-origin                Site-of-Origin extended community associated with the neighbor
  soft-reconfiguration          Per neighbor soft reconfiguration
  use                           Inherit configuration for this address-family from a group
  weight                        Set default weight for routes from this neighbor
  <cr>                          
RP/0/0/CPU0:XR1(config-bgp-vrf)#$family ipv4 unicast route-policy ?
  PASS        Name of the policy
  BGP_TO_RIP  Name of the policy
  WORD        Name of the policy
RP/0/0/CPU0:XR1(config-bgp-vrf)#$family ipv4 unicast route-policy BGP_TO_RIP ?
  (    Specify parameter values for the policy
  in   Apply route policy to inbound routes
  out  Apply route policy to outbound routes
RP/0/0/CPU0:XR1(config-bgp-vrf)#$olicy BGP_TO_RIP in ?oute-policy BGP_TO_RIP i
  <cr>  
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 address-family ipv4 unicas$
RP/0/0/CPU0:XR1(config-bgp-vrf)#neighbor 10.19.20.2 address-family ipv4 unicas$
RP/0/0/CPU0:XR1(config-bgp-vrf)#commit 
Tue Jul 10 16:31:09.420 UTC

% Failed to commit one or more configuration items during a pseudo-atomic operation. All changes made have been reverted. Please issue 'show configuration failed [inheritance]' from this session to view the errors
RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#show configuration failed 
Tue Jul 10 16:31:13.949 UTC
!! SEMANTIC ERRORS: This configuration was rejected by 
!! the system due to semantic errors. The individual 
!! errors with each failed configuration command can be 
!! found below.


router bgp 100
 vrf VPN_A
  neighbor 10.19.20.2
   address-family ipv4 unicast
    route-policy BGP_TO_RIP in
!!% Could not find entry in list: Policy [BGP_TO_RIP] uses the 'rip-metric' attribute. There is no 'rip-metric' attribute at the bgp neighbor-in-vrf attach point.
    route-policy BGP_TO_RIP out
!!% Could not find entry in list: Policy [BGP_TO_RIP] uses the 'rip-metric' attribute. There is no 'rip-metric' attribute at the bgp neighbor-in-vrf attach point.
   !
  !
 !
!
end

RP/0/0/CPU0:XR1(config-bgp-vrf)#
RP/0/0/CPU0:XR1(config-bgp-vrf)#do sh run r   
radius-server       radius  raw           rcc
rcp                 rd-set  route-policy  router
router-convergence  rp      rpl           rsvp
RP/0/0/CPU0:XR1(config-bgp-vrf)#do sh run route-policy BGP_TO_RIP
Tue Jul 10 16:31:34.928 UTC
route-policy BGP_TO_RIP
  if destination in (10.1.2.0/24) then
    set rip-metric 1
  else
    pass
  endif
end-policy
!

RP/0/0/CPU0:XR1(config-bgp-vrf)#exit
RP/0/0/CPU0:XR1(config-bgp)#exit
RP/0/0/CPU0:XR1(config)#route
route-policy  router  router-convergence  
RP/0/0/CPU0:XR1(config)#route-policy PASS
Tue Jul 10 16:32:29.784 UTC
% WARNING: Policy object route-policy PASS' exists! Reconfiguring it via CLI will replace current definition. Use 'abort to cancel.
RP/0/0/CPU0:XR1(config-rpl)#
RP/0/0/CPU0:XR1(config-rpl)#
RP/0/0/CPU0:XR1(config-rpl)#neighbor 10.19.20.2 address-family ipv4 unicast ro$
neighbor 10.19.20.2 address-family ipv4 unicast route-policy PASS in
^                                                                              

% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1(config-rpl)#
RP/0/0/CPU0:XR1(config-rpl)#
RP/0/0/CPU0:XR1(config-rpl)#exit
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#exit
Uncommitted changes found, commit them before exiting(yes/no/cancel)? [cancel]:no
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run router bgp     
Tue Jul 10 16:33:10.411 UTC
router bgp 100
 address-family ipv4 unicast
 !
 address-family vpnv4 unicast
 !
 neighbor 2.2.2.2
  remote-as 100
  update-source Loopback0
  address-family ipv4 unicast
   next-hop-self
  !
  address-family vpnv4 unicast
  !
 !
 vrf VPN_A
  rd 100:1
  address-family ipv4 unicast
   redistribute ospf 100
  !
  neighbor 10.19.20.2
   remote-as 1
   address-family ipv4 unicast
   !
  !
 !
!

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run formal router bgp 
Tue Jul 10 16:33:26.880 UTC
router bgp 100 
router bgp 100 address-family ipv4 unicast 
router bgp 100 address-family vpnv4 unicast 
router bgp 100 neighbor 2.2.2.2 
router bgp 100 neighbor 2.2.2.2 remote-as 100
router bgp 100 neighbor 2.2.2.2 update-source Loopback0
router bgp 100 neighbor 2.2.2.2 address-family ipv4 unicast 
router bgp 100 neighbor 2.2.2.2 address-family ipv4 unicast next-hop-self
router bgp 100 neighbor 2.2.2.2 address-family vpnv4 unicast 
router bgp 100 vrf VPN_A 
router bgp 100 vrf VPN_A rd 100:1
router bgp 100 vrf VPN_A address-family ipv4 unicast 
router bgp 100 vrf VPN_A address-family ipv4 unicast redistribute ospf 100
router bgp 100 vrf VPN_A neighbor 10.19.20.2 
router bgp 100 vrf VPN_A neighbor 10.19.20.2 remote-as 1
router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ipv4 unicast 

RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ip$
router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ipv4 unicast 
  ^                                                                            

% Invalid input detected at '^' marker.
RP/0/0/CPU0:XR1#conf t
Tue Jul 10 16:33:35.620 UTC
RP/0/0/CPU0:XR1(config)#router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-f$
RP/0/0/CPU0:XR1(config)#router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-f$
RP/0/0/CPU0:XR1(config)#commit 
Tue Jul 10 16:33:50.019 UTC
RP/0/0/CPU0:XR1(config)#
RP/0/0/CPU0:XR1(config)#end
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#
RP/0/0/CPU0:XR1#sh run formal router bgp                      
Tue Jul 10 16:34:19.347 UTC
router bgp 100 
router bgp 100 address-family ipv4 unicast 
router bgp 100 address-family vpnv4 unicast 
router bgp 100 neighbor 2.2.2.2 
router bgp 100 neighbor 2.2.2.2 remote-as 100
router bgp 100 neighbor 2.2.2.2 update-source Loopback0
router bgp 100 neighbor 2.2.2.2 address-family ipv4 unicast 
router bgp 100 neighbor 2.2.2.2 address-family ipv4 unicast next-hop-self
router bgp 100 neighbor 2.2.2.2 address-family vpnv4 unicast 
router bgp 100 vrf VPN_A 
router bgp 100 vrf VPN_A rd 100:1
router bgp 100 vrf VPN_A address-family ipv4 unicast 
router bgp 100 vrf VPN_A address-family ipv4 unicast redistribute ospf 100
router bgp 100 vrf VPN_A neighbor 10.19.20.2 
router bgp 100 vrf VPN_A neighbor 10.19.20.2 remote-as 1
router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ipv4 unicast 
router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ipv4 unicast route-policy PASS in
router bgp 100 vrf VPN_A neighbor 10.19.20.2 address-family ipv4 unicast route-policy PASS out

RP/0/0/CPU0:XR1#
